mock-server/test_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:tns="http://hospital-supply-chain.example.com/soap/stock">
    <soap:Body>
        <tns:StockUpdateRequest>
            <tns:hospitalId>HOSP-ISTANBUL-01</tns:hospitalId>
            <tns:productCode>MED-GLOVES-L</tns:productCode>
            <tns:currentStockUnits>150</tns:currentStockUnits>
            <tns:dailyConsumptionUnits>25</tns:dailyConsumptionUnits>
            <tns:daysOfSupply>6.0</tns:daysOfSupply>
            <tns:timestamp>2026-01-03T14:30:00.000Z</tns:timestamp>
        </tns:StockUpdateRequest>
    </soap:Body>
</soap:Envelope>
